Revit 2026 API

# FaceIntersect(Curve) Method

---

Calculates the intersection of the specified curve with this face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SetComparisonResult Intersect(
	Curve curve
)
```
```vb
Public Function Intersect (
	curve As Curve
) As SetComparisonResult
```
```cpp
public:
SetComparisonResult Intersect(
	Curve^ curve
)
```
```fsharp
member Intersect :
        curve : Curve -> SetComparisonResult
```

#### Parameters

curve Curve
    The specified curve to intersect with this face.

#### Return Value

SetComparisonResult

  * SetComparisonResult.Overlap - One or more intersections were encountered.
  * SetComparisonResult.Subset - The curve is coincident with the surface.
  * SetComparisonResult.Disjoint - There is no intersection found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | The curve is . |
| InvalidOperationException | The intersection calculation fails. |

#### Reference

Face Class

Intersect Overload

Autodesk.Revit.DB Namespace